// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int A = 4;

if (A % 2 == 0)
{
  Console.WriteLine("четное число"); 
}
else
{
  Console.WriteLine("нечетное число"); 
}
