// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

int N = 10;
ArrayLength (1-N);
index = 0;
even_numbers;

while (index < ArrayLength)
{
    if
    {
        number % 2 = 0 
    number (index) add to even_numbers;

    }

    Index ++   

Console.Write("Четные числа: ");
Console.WriteLine(even_numbers);
}
