//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

int A = 15;

int B = 145;

if (A > B)
{
    Console.WriteLine("max = A");
    Console.WriteLine(A);
}
else
{
    Console.WriteLine("max = B");
    Console.WriteLine(B);
}

