//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

int A = -9;
int B = -3;

if (A > B)
{
    Console.Write("max = ");
    Console.WriteLine(A);
}
else
{
    Console.Write("max = ");
    Console.WriteLine(B);    
}

