//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

intA = 15;

intB = 145;

if (intA > intB)
{
    Console.WriteLine("max = intA");
    Concole.WriteLine(max);
}
else
{
    Console.WriteLine("max = intB");
    Concole.WriteLine(max);
}

